---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.BoundaryDetectError
source: html/8c8c3bba-c6e1-d8ee-6738-d87fc72f527d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.BoundaryDetectError Property

A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.

## Syntax (C#)
```csharp
public static FailureDefinitionId BoundaryDetectError { get; }
```